Конфигурация/Catalogs/ИнвестиционныеДекларации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Catalog>
		<Properties>
			<Name>ИнвестиционныеДекларации</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Консолидирующая</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьМинимальноеЗначениеРейтинга</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьЦелевоеЗначение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УчастиеВГолосовании</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипИнвестиционнойДекларации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыИнвестиционныхДеклараций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СовокупныйКонтроль</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Показатели</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Базис</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.БазисыКонтроляИнвестиционныхДеклараций</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КонтролируемыйПоказатель</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>МинимальноеЗначение</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>19</v8:Digits>
									<v8:FractionDigits>6</v8:FractionDigits>
								</v8:NumberQualifiers>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>МаксимальноеЗначение</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>19</v8:Digits>
									<v8:FractionDigits>6</v8:FractionDigits>
								</v8:NumberQualifiers>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АбсолютнаяВеличинаМин</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АбсолютнаяВеличинаМакс</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОбъединятьОтборы</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НаборИнвестиционнойДекларации</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.НаборыИнвестиционныхДеклараций</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИнвестиционнаяДекларация</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ИнвестиционныеДекларации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЦелевоеЗначение</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АбсолютнаяВеличинаЦель</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВнутреннийНабор</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОпределяетСоставИСтруктуру</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИдентификаторСКДБазиса</Name>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>МакетКомпоновки</Name>
							<Type>
								<v8:Type>v8:ValueStorage</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИдентификаторСКДНабора</Name>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Эмитент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЮрФизЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ГруппаЭмитентов</Name>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВключаяФилиалы</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЦеннаяБумага</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.БазовыеСтавкиОблигаций</v8:Type>
								<v8:Type>cfg:CatalogRef.ВалютныеПары</v8:Type>
								<v8:Type>cfg:CatalogRef.Векселя</v8:Type>
								<v8:Type>cfg:CatalogRef.Облигации</v8:Type>
								<v8:Type>cfg:CatalogRef.ПроизводныеФинансовыеИнструменты</v8:Type>
								<v8:Type>cfg:CatalogRef.Паи</v8:Type>
								<v8:Type>cfg:CatalogRef.ДепозитарныеРасписки</v8:Type>
								<v8:Type>cfg:CatalogRef.Доли</v8:Type>
								<v8:Type>cfg:CatalogRef.Закладные</v8:Type>
								<v8:Type>cfg:CatalogRef.ИпотечныеСертификатыУчастия</v8:Type>
								<v8:Type>cfg:CatalogRef.Акции</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ГруппаЦенныхБумаг</Name>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИдентификаторСтрокиПоказателей</Name>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаЗапретаПокупки</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗапасМин</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>4</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗапасМакс</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>4</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаНачалаДействия</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ГруппыЭмитентов</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Идентификатор</Name>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Имя</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Эмитенты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Группа</Name>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Эмитент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЮрФизЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ГруппыЦенныхБумаг</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Идентификатор</Name>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Имя</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ЦенныеБумаги</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Группа</Name>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЦеннаяБумага</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.БазовыеСтавкиОблигаций</v8:Type>
								<v8:Type>cfg:CatalogRef.ВалютныеПары</v8:Type>
								<v8:Type>cfg:CatalogRef.Векселя</v8:Type>
								<v8:Type>cfg:CatalogRef.Облигации</v8:Type>
								<v8:Type>cfg:CatalogRef.ПроизводныеФинансовыеИнструменты</v8:Type>
								<v8:Type>cfg:CatalogRef.Паи</v8:Type>
								<v8:Type>cfg:CatalogRef.ДепозитарныеРасписки</v8:Type>
								<v8:Type>cfg:CatalogRef.Доли</v8:Type>
								<v8:Type>cfg:CatalogRef.Закладные</v8:Type>
								<v8:Type>cfg:CatalogRef.ИпотечныеСертификатыУчастия</v8:Type>
								<v8:Type>cfg:CatalogRef.Акции</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>СчетаДоверительногоУправления</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>СчетДоверительногоУправления</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Конфигурация/Catalogs/ИнвестиционныеДекларации/Ext/ManagerModule.bsl
Процедура ОбновитьМакетыКомпоновки(ИнвестиционнаяДекларацияСсылка, НомераСтрокДляОбновления = Неопределено) Экспорт

	НачатьТранзакцию();
	
	УстановитьБлокировкиОбъектов(ИнвестиционнаяДекларацияСсылка, НомераСтрокДляОбновления);
	
	ИнвестиционнаяДекларация = ИнвестиционнаяДекларацияСсылка.ПолучитьОбъект();
	
	ПараметрыБазисов = СформироватьПараметрыБазисов(ИнвестиционнаяДекларацияСсылка);
	
	ГруппыЭмитентов = ПолучитьГруппыЭмитентов(ИнвестиционнаяДекларацияСсылка);
	ГруппыАктивов = ПолучитьГруппыАктивов(ИнвестиционнаяДекларацияСсылка);
	
	Для каждого СтрокаПоказателей Из ИнвестиционнаяДекларация.Показатели Цикл
		
		Если ТипЗнч(НомераСтрокДляОбновления) = Тип("Массив") И НомераСтрокДляОбновления.Найти(СтрокаПоказателей.НомерСтроки) = Неопределено Тогда
			Продолжить;
		КонецЕсли;
	
		ПараметрыБазиса = ПараметрыБазисов[Строкапоказателей.Базис];
		
		ПараметрыПоказателя = ПараметрыБазиса.КонтролируемыеПоказатели.Найти(СтрокаПоказателей.КонтролируемыйПоказатель, "Представление");
		
		СКД = ПараметрыБазиса.СКД;
		Настройки = ПараметрыБазиса.НастройкиСКД.Получить();
		
		// ресурсы
		СКД.ПоляИтога.Очистить();
		
		ПолеИтога = СКД.ПоляИтога.Добавить();
		ПолеИтога.Выражение = ПараметрыПоказателя.ВыражениеПоказатель;
		ЗаполнитьЗначенияСвойств(ПолеИтога, ПараметрыПоказателя);
		
		ПолеИтогаДоля = СКД.ПоляИтога.Добавить();
		ПолеИтогаДоля.ПутьКДанным = ПараметрыПоказателя.ИмяПоляДоля;
		ПолеИтогаДоля.Выражение = ПараметрыПоказателя.ВыражениеДоля;
		ЗаполнитьЗначенияСвойств(ПолеИтогаДоля, ПолеИтога,, "ПутьКДанным, Выражение");			
		
		Для каждого ПутьКДанным Из ПараметрыПоказателя.Группировки Цикл
			ПолеИтога.Группировки.Добавить(ПутьКДанным);
			ПолеИтогаДоля.Группировки.Добавить(ПутьКДанным);
		КонецЦикла;
		
		// выбранные поля
		ПолеВыбор = Настройки.Выбор.Элементы.Добавить(Тип("ВыбранноеПолеКомпоновкиДанных"));
		ПолеВыбор.Использование = Истина;
		ПолеВыбор.Поле = Новый ПолеКомпоновкиДанных(ПараметрыПоказателя.ПутьКДанным);
		ПолеВыбор.Заголовок = ПараметрыПоказателя.Представление;
		
		ПолеВыбор = Настройки.Выбор.Элементы.Добавить(Тип("ВыбранноеПолеКомпоновкиДанных"));
		ПолеВыбор.Использование = Истина;
		ПолеВыбор.Поле = Новый ПолеКомпоновкиДанных(ПараметрыПоказателя.ИмяПоляДоля);
		ПолеВыбор.Заголовок = ПараметрыПоказателя.ИмяПоляДоля;
						
		Если ТипЗнч(СтрокаПоказателей.МинимальноеЗначение) = Тип("Строка") Тогда
			ПолеВыбор = Настройки.Выбор.Элементы.Добавить(Тип("ВыбранноеПолеКомпоновкиДанных"));
			ПолеВыбор.Использование = Истина;
			ПолеВыбор.Поле = Новый ПолеКомпоновкиДанных(СтрокаПоказателей.МинимальноеЗначение);
			ПолеИтога = СКД.ПоляИтога.Добавить();
			ПолеИтога.Выражение = СтрокаПоказателей.МинимальноеЗначение;
			ПолеИтога.ПутьКДанным = СтрокаПоказателей.МинимальноеЗначение;
		КонецЕсли; 
		
		Если ТипЗнч(СтрокаПоказателей.МаксимальноеЗначение) = Тип("Строка") Тогда
			ПолеВыбор = Настройки.Выбор.Элементы.Добавить(Тип("ВыбранноеПолеКомпоновкиДанных"));
			ПолеВыбор.Использование = Истина;
			ПолеВыбор.Поле = Новый ПолеКомпоновкиДанных(СтрокаПоказателей.МаксимальноеЗначение);
			ПолеИтога = СКД.ПоляИтога.Добавить();
			ПолеИтога.Выражение = СтрокаПоказателей.МаксимальноеЗначение;
			ПолеИтога.ПутьКДанным = СтрокаПоказателей.МаксимальноеЗначение;
		КонецЕсли; 
		
		// структура
		НоваяГруппировка = Настройки.Структура.Добавить(Тип("ГруппировкаКомпоновкиДанных"));
		НоваяГруппировка.Выбор.Элементы.Добавить(Тип("АвтоВыбранноеПолеКомпоновкиДанных"));
		НоваяГруппировка.ПараметрыВывода.УстановитьЗначениеПараметра("ВертикальноеРасположениеОбщихИтогов", РасположениеИтоговКомпоновкиДанных.Нет);
		
		ВложеннаяГруппировка = НоваяГруппировка.Структура.Добавить(Тип("ГруппировкаКомпоновкиДанных"));
		ВложеннаяГруппировка.Выбор.Элементы.Добавить(Тип("АвтоВыбранноеПолеКомпоновкиДанных"));
		ВложеннаяГруппировка.ПараметрыВывода.УстановитьЗначениеПараметра("ВертикальноеРасположениеОбщихИтогов", РасположениеИтоговКомпоновкиДанных.Нет);
		Для каждого Поле Из ПараметрыБазиса.ТаблицаПолей Цикл
			Если Поле.Ключ Тогда
				ПолеГруппировки = ВложеннаяГруппировка.ПоляГруппировки.Элементы.Добавить(Тип("ПолеГруппировкиКомпоновкиДанных"));
				ПолеГруппировки.Поле = Новый ПолеКомпоновкиДанных(Поле.ПутьКДанным);
			КонецЕсли; 
		КонецЦикла;
		
		ПолеГруппировки = ВложеннаяГруппировка.ПоляГруппировки.Элементы.Добавить(Тип("ПолеГруппировкиКомпоновкиДанных")); // !хардкод 
		ПолеГруппировки.Поле = Новый ПолеКомпоновкиДанных("ЦенныеБумаги.ОтсутствуетСтоимостьПереоценки");
		
		Если ПараметрыПоказателя.ПутьКДанным <> "ЦенныеБумаги.Количество" Тогда
		
			ПолеВыбор = Настройки.Выбор.Элементы.Добавить(Тип("ВыбранноеПолеКомпоновкиДанных"));
			ПолеВыбор.Использование = Истина;
			ПолеВыбор.Поле = Новый ПолеКомпоновкиДанных("ЦенныеБумаги.Количество");
			ПолеВыбор.Заголовок = "Количество";
							
			ПолеГруппировки = ВложеннаяГруппировка.ПоляГруппировки.Элементы.Добавить(Тип("ПолеГруппировкиКомпоновкиДанных"));
			ПолеГруппировки.Поле = Новый ПолеКомпоновкиДанных("ЦенныеБумаги.Количество");
		
		КонецЕсли; 

		// заполняем параметры
		Для каждого ПараметрФормирования Из ПараметрыБазиса.ПараметрыСКД Цикл
			Если Не Настройки.ПараметрыДанных.Элементы.Найти(ПараметрФормирования.Ключ) = Неопределено Тогда
				Настройки.ПараметрыДанных.УстановитьЗначениеПараметра(ПараметрФормирования.Ключ, ПараметрФормирования.Значение);
			КонецЕсли; 
		КонецЦикла;	
			
		// добавляем группировку
		ПолеГруппировки = НоваяГруппировка.ПоляГруппировки.Элементы.Добавить(Тип("ПолеГруппировкиКомпоновкиДанных"));
		ПолеГруппировки.Поле = Новый ПолеКомпоновкиДанных(ПараметрыПоказателя.ГруппировкаСтруктуры);

		// отборы
		Если НЕ СтрокаПоказателей.ОбъединятьОтборы Тогда
			Настройки.Отбор.Элементы.Очистить();
		КонецЕсли; 

	    // дополняем настройки СКД базиса отборами строки настройки контроля инвест декларации
		УсловияОтбора = СтрокаПоказателей.НаборИнвестиционнойДекларации.УсловияОтбора.Получить();
		
		ЗаполнитьОтбор(Настройки.Отбор, УсловияОтбора.Отбор);
		ДополнитьОтборПоСтрокеПоказателей(Настройки.Отбор, СтрокаПоказателей, ГруппыЭмитентов, ГруппыАктивов);
		
		ЗаполнитьПользовательскиеПоля(Настройки.ПользовательскиеПоля, УсловияОтбора.ПользовательскиеПоля);
		
		КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
		МакетКомпоновки = КомпоновщикМакета.Выполнить(СКД, Настройки,,, Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"));
		
		СтрокаПоказателей.ИдентификаторСКДБазиса = ПараметрыБазисов[СтрокаПоказателей.Базис].ИдентификаторСКД;
		СтрокаПоказателей.ИдентификаторСКДНабора = СтрокаПоказателей.НаборИнвестиционнойДекларации.ИдентификаторСКД;
		СтрокаПоказателей.МакетКомпоновки = Новый ХранилищеЗначения(МакетКомпоновки, Новый СжатиеДанных(9));
	
	КонецЦикла; 
	
	ИнвестиционнаяДекларация.Записать();

	ЗафиксироватьТранзакцию();
	
КонецПроцедуры

Процедура УстановитьБлокировкиОбъектов(ИнвестиционнаяДекларация, НомераСтрокДляОбновления)

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", ИнвестиционнаяДекларация);
	Запрос.УстановитьПараметр("НомераСтрокДляОбновления", НомераСтрокДляОбновления);
	Запрос.УстановитьПараметр("ВсеСтроки", НомераСтрокДляОбновления = Неопределено);
	#Область ТекстЗапроса
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ИнвестиционныеДекларацииПоказатели.Базис КАК Базис,
		|	ИнвестиционныеДекларацииПоказатели.НаборИнвестиционнойДекларации КАК НаборИнвестиционнойДекларации
		|ПОМЕСТИТЬ _Показатели
		|ИЗ
		|	Справочник.ИнвестиционныеДекларации.Показатели КАК ИнвестиционныеДекларацииПоказатели
		|ГДЕ
		|	ИнвестиционныеДекларацииПоказатели.Ссылка = &Ссылка
		|	И (&ВсеСтроки
		|			ИЛИ ИнвестиционныеДекларацииПоказатели.НомерСтроки В (&НомераСтрокДляОбновления))
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	_Показатели.Базис КАК Ссылка
		|ИЗ
		|	_Показатели КАК _Показатели
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	_Показатели.НаборИнвестиционнойДекларации КАК Ссылка
		|ИЗ
		|	_Показатели КАК _Показатели";		
	#КонецОбласти 
	
	Результат = Запрос.ВыполнитьПакет();
	
	Базисы = Результат[Результат.ВГраница()-1];
	Наборы = Результат[Результат.ВГраница()];
	
	Блокировка = Новый БлокировкаДанных;
	
	ЭлементБлокировки = Блокировка.Добавить("Справочник.ИнвестиционныеДекларации");
	ЭлементБлокировки.УстановитьЗначение("Ссылка", ИнвестиционнаяДекларация);
	ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
	
	ЭлементБлокировки = Блокировка.Добавить("Справочник.БазисыКонтроляИнвестиционныхДеклараций");
	ЭлементБлокировки.ИсточникДанных = Базисы;
	ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Ссылка", "Ссылка");
	ЭлементБлокировки.Режим = РежимБлокировкиДанных.Разделяемый;
	
	ЭлементБлокировки = Блокировка.Добавить("Справочник.НаборыИнвестиционныхДеклараций");
	ЭлементБлокировки.ИсточникДанных = Наборы;
	ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Ссылка", "Ссылка");
	ЭлементБлокировки.Режим = РежимБлокировкиДанных.Разделяемый;
	
	Блокировка.Заблокировать();

КонецПроцедуры

Функция СформироватьПараметрыБазисов(ИнвестиционнаяДекларация)

	// получаем все базисы по выбранной инвестдекларации
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ИнвестиционнаяДекларация", ИнвестиционнаяДекларация);
	#Область ТекстЗапроса
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	ИнвестиционныеДекларацииПоказатели.Базис КАК Базис,
		|	ИнвестиционныеДекларации.ИспользоватьМинимальноеЗначениеРейтинга КАК ИспользоватьМинимальноеЗначениеРейтинга
		|ПОМЕСТИТЬ _Базисы
		|ИЗ
		|	Справочник.ИнвестиционныеДекларации.Показатели КАК ИнвестиционныеДекларацииПоказатели
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.БазисыКонтроляИнвестиционныхДеклараций КАК БазисыКонтроляИнвестиционныхДеклараций
		|		ПО ИнвестиционныеДекларацииПоказатели.Базис = БазисыКонтроляИнвестиционныхДеклараций.Ссылка
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ИнвестиционныеДекларации КАК ИнвестиционныеДекларации
		|		ПО ИнвестиционныеДекларацииПоказатели.Ссылка = ИнвестиционныеДекларации.Ссылка
		|ГДЕ
		|	ИнвестиционныеДекларацииПоказатели.Ссылка В
		|			(ВЫБРАТЬ
		|				&ИнвестиционнаяДекларация
		|		
		|			ОБЪЕДИНИТЬ ВСЕ
		|		
		|			ВЫБРАТЬ РАЗЛИЧНЫЕ
		|				ИнвестиционныеДекларацииПоказатели.ИнвестиционнаяДекларация
		|			ИЗ
		|				Справочник.ИнвестиционныеДекларации.Показатели КАК ИнвестиционныеДекларацииПоказатели
		|			ГДЕ
		|				ИнвестиционныеДекларацииПоказатели.Ссылка = &ИнвестиционнаяДекларация)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_Базисы.Базис КАК Базис,
		|	БазисыКонтроляИнвестиционныхДеклараций.ХранилищеСКД КАК ХранилищеСКД,
		|	БазисыКонтроляИнвестиционныхДеклараций.ХранилищеНастроек КАК ХранилищеНастроек,
		|	БазисыКонтроляИнвестиционныхДеклараций.НаборДанных КАК НаборДанных,
		|	БазисыКонтроляИнвестиционныхДеклараций.РежимПолученияБазы КАК РежимПолученияБазы,
		|	БазисыКонтроляИнвестиционныхДеклараций.ИдентификаторСКД КАК ИдентификаторСКД,
		|	_Базисы.ИспользоватьМинимальноеЗначениеРейтинга КАК ИспользоватьМинимальноеЗначениеРейтинга
		|ИЗ
		|	_Базисы КАК _Базисы
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.БазисыКонтроляИнвестиционныхДеклараций КАК БазисыКонтроляИнвестиционныхДеклараций
		|		ПО _Базисы.Базис = БазисыКонтроляИнвестиционныхДеклараций.Ссылка";		
	#КонецОбласти 
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	ПараметрыБазисов = Новый Соответствие;
	
	Пока Выборка.Следующий() Цикл
		Если ПараметрыБазисов.Получить(Выборка.Базис) = Неопределено Тогда
		
			СКДХранилище = Выборка.ХранилищеСКД;
			
			Попытка
				СКД = СКДХранилище.Получить();
			Исключение
				ВызватьИсключение "Не удалось получить СКД базиса";
			КонецПопытки; 
			
			НастройкиХранилище = Выборка.ХранилищеНастроек;
			
			Попытка
				Настройки = НастройкиХранилище.Получить();
			Исключение
				ВызватьИсключение "Не удалось получить настройки базиса";
			КонецПопытки;
			
			Если Выборка.ИспользоватьМинимальноеЗначениеРейтинга Тогда
				НаборДанныхРейтинги = СКД.НаборыДанных.Найти("Рейтинги");
				Если ТипЗнч(НаборДанныхРейтинги) = Тип("НаборДанныхЗапросСхемыКомпоновкиДанных") Тогда
					НаборДанныхРейтинги.Запрос = СтрЗаменить(НаборДанныхРейтинги.Запрос, "МИНИМУМ(_РасчетРейтингов.Приоритет", "МАКСИМУМ(_РасчетРейтингов.Приоритет"); // !хардкод 
				КонецЕсли;
			КонецЕсли;
			
			ПараметрыСКД = Новый Структура;
			ПараметрыСКД.Вставить("грПериод", 		Новый Граница('00010101', ВидГраницы.Включая));
			ПараметрыСКД.Вставить("ВалютаУчета", 	Справочники.Валюты.ПустаяСсылка());
			
			ПараметрыБазиса = Новый Структура;						
			ПараметрыБазиса.Вставить("СКД", 						СКД);
			ПараметрыБазиса.Вставить("НастройкиСКД", 				НастройкиХранилище);
			ПараметрыБазиса.Вставить("ТаблицаПолей", 				Справочники.БазисыКонтроляИнвестиционныхДеклараций.ПолучитьОписаниеПолейБазиса(Выборка.НаборДанных));
			ПараметрыБазиса.Вставить("КонтролируемыеПоказатели",	Справочники.БазисыКонтроляИнвестиционныхДеклараций.ПолучитьОписаниеКонтролируемыхПоказателей(Выборка.НаборДанных));
			ПараметрыБазиса.Вставить("ПараметрыСКД", 				ПараметрыСКД);
			ПараметрыБазиса.Вставить("ИдентификаторСКД",			Выборка.ИдентификаторСКД);
								
			ПараметрыБазисов.Вставить(Выборка.Базис, ПараметрыБазиса);
			
		КонецЕсли;
		
	КонецЦикла; 
	
	Возврат ПараметрыБазисов;
	
КонецФункции

Процедура ЗаполнитьОтбор(Приемник, Источник, ЛевоеЗначениеБезГрупп = Ложь, УдалитьОтборПоБрокеру = Ложь, ОтборПоБрокеруУдален = Ложь) Экспорт
	
	Для каждого ЭлементОтбора Из Источник.Элементы Цикл
		
		НовыйОтбор = Приемник.Элементы.Добавить(ТипЗнч(ЭлементОтбора));
		ЗаполнитьЗначенияСвойств(НовыйОтбор, ЭлементОтбора);
		
		Если ТипЗнч(ЭлементОтбора) = Тип("ГруппаЭлементовОтбораКомпоновкиДанных") Тогда
		
			ЗаполнитьОтбор(НовыйОтбор, ЭлементОтбора, ЛевоеЗначениеБезГрупп, УдалитьОтборПоБрокеру, ОтборПоБрокеруУдален);
			
		Иначе
			
			Если УдалитьОтборПоБрокеру И НовыйОтбор.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Основные.ВидАктива") Тогда
				
				ПравоеЗначение = НовыйОтбор.ПравоеЗначение;
				
				Если ТипЗнч(ПравоеЗначение) = Тип("Строка") И ПравоеЗначение = "Денежные средства у брокера" Тогда
					НовыйОтбор.ПравоеЗначение = "";
					ОтборПоБрокеруУдален = Истина;
				ИначеЕсли ТипЗнч(ПравоеЗначение) = Тип("СписокЗначений") Тогда 
					Элемент = ПравоеЗначение.НайтиПоЗначению("Денежные средства у брокера");
					Если Элемент <> Неопределено Тогда
						Элемент.Значение = "";
						ОтборПоБрокеруУдален = Истина;
					КонецЕсли; 
				КонецЕсли; 
			
			КонецЕсли;
			
			Если ЛевоеЗначениеБезГрупп Тогда
			
				НовыйОтбор.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(ЭлементОтбора.ЛевоеЗначение);
				
			КонецЕсли;
			
		КонецЕсли; 
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьПользовательскиеПоля(Приемник, Источник, ОчищатьПоляПриемника = Истина) Экспорт

	Если ОчищатьПоляПриемника Тогда
		Приемник.Элементы.Очистить();
	КонецЕсли;
	
	Для каждого ПользовательскоеПоле Из Источник.Элементы Цикл
		
		НовоеПоле = Приемник.Элементы.Добавить(ТипЗнч(ПользовательскоеПоле));
		ЗаполнитьЗначенияСвойств(НовоеПоле, ПользовательскоеПоле);
		
		Если ТипЗнч(НовоеПоле) = Тип("ПользовательскоеПолеВыражениеКомпоновкиДанных") Тогда
			НовоеПоле.УстановитьВыражения(ПользовательскоеПоле.ПолучитьВыражениеДетальныхЗаписей(), ПользовательскоеПоле.ПолучитьВыражениеИтоговыхЗаписей());
		Иначе
			Для каждого Вариант Из ПользовательскоеПоле.Варианты.Элементы Цикл
			
				НовыйВариант = НовоеПоле.Варианты.Добавить();
				ЗаполнитьЗначенияСвойств(НовыйВариант, Вариант);
				ЗаполнитьОтбор(НовыйВариант.Отбор, Вариант.Отбор);
			
			КонецЦикла; 
		КонецЕсли; 
		
	КонецЦикла; 

КонецПроцедуры  

Функция ПолучитьГруппыЭмитентов(ИнвестиционнаяДекларация) Экспорт

	ГруппыЭмитентов = Новый Соответствие;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ИнвестиционныеДекларацииЭмитенты.Группа КАК Группа,
		|	ИнвестиционныеДекларацииЭмитенты.Эмитент КАК Эмитент,
		|	ИнвестиционныеДекларацииГруппыЭмитентов.Имя КАК ИмяГруппы
		|ИЗ
		|	Справочник.ИнвестиционныеДекларации.ГруппыЭмитентов КАК ИнвестиционныеДекларацииГруппыЭмитентов
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ИнвестиционныеДекларации.Эмитенты КАК ИнвестиционныеДекларацииЭмитенты
		|		ПО ИнвестиционныеДекларацииГруппыЭмитентов.Ссылка = ИнвестиционныеДекларацииЭмитенты.Ссылка
		|			И ИнвестиционныеДекларацииГруппыЭмитентов.Идентификатор = ИнвестиционныеДекларацииЭмитенты.Группа
		|ГДЕ
		|	ИнвестиционныеДекларацииЭмитенты.Ссылка = &Ссылка
		|ИТОГИ
		|	МАКСИМУМ(ИмяГруппы)
		|ПО
		|	Группа";
	
	Запрос.УстановитьПараметр("Ссылка", ИнвестиционнаяДекларация);
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаГруппа = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаГруппа.Следующий() Цикл
		
		СписокЭмитентов = Новый СписокЗначений;
		
		ВыборкаЭмитент = ВыборкаГруппа.Выбрать();
		Пока ВыборкаЭмитент.Следующий() Цикл
			СписокЭмитентов.Добавить(ВыборкаЭмитент.Эмитент);
		КонецЦикла;
		
		СвойстваГруппы = Новый Структура("Имя, СписокЭмитентов", ВыборкаГруппа.ИмяГруппы, СписокЭмитентов);
		ГруппыЭмитентов.Вставить(ВыборкаГруппа.Группа, СвойстваГруппы);
		
	КонецЦикла;
	
	Возврат ГруппыЭмитентов;

КонецФункции

Функция ПолучитьГруппыАктивов(ИнвестиционнаяДекларация) Экспорт

	ГруппыАктивов = Новый Соответствие;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ИнвестиционныеДекларацииЦенныеБумаги.Группа КАК Группа,
		|	ИнвестиционныеДекларацииЦенныеБумаги.ЦеннаяБумага КАК ЦеннаяБумага,
		|	ИнвестиционныеДекларацииГруппыЦенныхБумаг.Имя КАК ИмяГруппы
		|ИЗ
		|	Справочник.ИнвестиционныеДекларации.ГруппыЦенныхБумаг КАК ИнвестиционныеДекларацииГруппыЦенныхБумаг
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ИнвестиционныеДекларации.ЦенныеБумаги КАК ИнвестиционныеДекларацииЦенныеБумаги
		|		ПО ИнвестиционныеДекларацииГруппыЦенныхБумаг.Ссылка = ИнвестиционныеДекларацииЦенныеБумаги.Ссылка
		|			И ИнвестиционныеДекларацииГруппыЦенныхБумаг.Идентификатор = ИнвестиционныеДекларацииЦенныеБумаги.Группа
		|ГДЕ
		|	ИнвестиционныеДекларацииЦенныеБумаги.Ссылка = &Ссылка
		|ИТОГИ
		|	МАКСИМУМ(ИмяГруппы)
		|ПО
		|	Группа";;
	
	Запрос.УстановитьПараметр("Ссылка", ИнвестиционнаяДекларация);
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаГруппа = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаГруппа.Следующий() Цикл
		
		СписокАктивов = Новый СписокЗначений;
		
		ВыборкаАктив = ВыборкаГруппа.Выбрать();
		Пока ВыборкаАктив.Следующий() Цикл
			СписокАктивов.Добавить(ВыборкаАктив.ЦеннаяБумага);
		КонецЦикла;
		
		СвойстваГруппы = Новый Структура("Имя, СписокАктивов", ВыборкаГруппа.ИмяГруппы, СписокАктивов);
		ГруппыАктивов.Вставить(ВыборкаГруппа.Группа, СвойстваГруппы);
		
	КонецЦикла;
	
	Возврат ГруппыАктивов;

КонецФункции

Процедура ДополнитьОтборПоСтрокеПоказателей(Отбор, СтрокаПоказателей, ГруппыЭмитентов, ГруппыАктивов) Экспорт

	Если ЗначениеЗаполнено(СтрокаПоказателей.Эмитент) Или ЗначениеЗаполнено(СтрокаПоказателей.ГруппаЭмитентов) Тогда
	
		ПутьКДаннымПоля = ?(СтрокаПоказателей.ВключаяФилиалы, "Основные.ГоловнаяОрганизация", "Основные.Эмитент");
		
		Если ЗначениеЗаполнено(СтрокаПоказателей.Эмитент) Тогда
			ВидСравненияОтбора = ВидСравненияКомпоновкиДанных.Равно;
			ПравоеЗначение = СтрокаПоказателей.Эмитент;
		Иначе
			ВидСравненияОтбора = ВидСравненияКомпоновкиДанных.ВСписке;
			ПравоеЗначение = ГруппыЭмитентов.Получить(СтрокаПоказателей.ГруппаЭмитентов).СписокЭмитентов;
		КонецЕсли; 
		
		НовыйОтбор = Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		
		НовыйОтбор.Использование 	= Истина;
		НовыйОтбор.ЛевоеЗначение 	= Новый ПолеКомпоновкиДанных(ПутьКДаннымПоля);
		НовыйОтбор.ВидСравнения 	= ВидСравненияОтбора;
		НовыйОтбор.ПравоеЗначение 	= ПравоеЗначение;
	
	КонецЕсли; 
	
	Если ЗначениеЗаполнено(СтрокаПоказателей.ЦеннаяБумага) Или ЗначениеЗаполнено(СтрокаПоказателей.ГруппаЦенныхБумаг) Тогда
	
		Если ЗначениеЗаполнено(СтрокаПоказателей.ЦеннаяБумага) Тогда
			ВидСравненияОтбора = ВидСравненияКомпоновкиДанных.Равно;
			ПравоеЗначение = СтрокаПоказателей.ЦеннаяБумага;
		Иначе
			ВидСравненияОтбора = ВидСравненияКомпоновкиДанных.ВСписке;
			ПравоеЗначение = ГруппыАктивов.Получить(СтрокаПоказателей.ГруппаЦенныхБумаг).СписокАктивов;
		КонецЕсли; 
		
		Если РаботаСНастройкамиСписковКлиентСервер.НайтиЭлементыИГруппыОтбора(Отбор, "Основные.Актив").Количество() = 0 Тогда
			ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Основные.Актив");
		Иначе
			ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Основные.СубъектАналитики");
		КонецЕсли;
		
		НовыйОтбор = Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		
		НовыйОтбор.Использование 	= Истина;
		НовыйОтбор.ЛевоеЗначение 	= ЛевоеЗначение;
		НовыйОтбор.ВидСравнения 	= ВидСравненияОтбора;
		НовыйОтбор.ПравоеЗначение 	= ПравоеЗначение;
		
	КонецЕсли; 
	
	Если ЗначениеЗаполнено(СтрокаПоказателей.ДатаЗапретаПокупки) Тогда
	
		НовыйОтбор = Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		
		НовыйОтбор.Использование 	= Истина;
		НовыйОтбор.ЛевоеЗначение 	= Новый ПолеКомпоновкиДанных("Основные.ДатаПоследнейПокупки");
		НовыйОтбор.ВидСравнения 	= ВидСравненияКомпоновкиДанных.БольшеИлиРавно;
		НовыйОтбор.ПравоеЗначение 	= СтрокаПоказателей.ДатаЗапретаПокупки;
		
	КонецЕсли;

КонецПроцедуры
